Desired Number of Risers is too small. Computed Actual Riser Height is greater than Maximum Riser Height allowed by type.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
 Syntax
  C#
public static FailureDefinitionId StairsIllegalDesiredNumRisers { get; }
  Visual Basic
Public Shared ReadOnly Property StairsIllegalDesiredNumRisers As FailureDefinitionId
	Get
  Visual C++
public:
static property FailureDefinitionId^ StairsIllegalDesiredNumRisers {
	FailureDefinitionId^ get ();
}
 See Also
  BuiltInFailures StairRampFailures Class
  Autodesk.Revit.DB Namespace